{"fomc_doc": {"meeting_date": "2001-10-02", "paragraphs": ["\nFor immediate release\n", "The Federal Open Market Committee decided today to lower its target for the federal funds rate by 50 basis points to 2-1/2 percent. In a related action, the Board of Governors approved a 50 basis point reduction in the discount rate to 2 percent.\r\n", "\r\nThe terrorist attacks have significantly heightened uncertainty in an economy that was already weak.  Business and household spending as a consequence are being further damped.  Nonetheless, the long-term prospects for productivity growth and the economy remain favorable and should become evident once the unusual forces restraining demand abate. \r\n", "\r\nThe Committee continues to believe that, against the background of its long-run goals of price stability and sustainable economic growth and of the information currently available, the risks are weighted mainly toward conditions that may generate economic weakness in the foreseeable future.\r\n      ", " In taking the discount rate action, the Federal Reserve Board approved requests \r\n        submitted by the Boards of Directors of the Federal Reserve Banks of Boston, \r\n        New York, Cleveland, Richmond, Atlanta, St. Louis, Kansas City and San \r\n        Francisco. \r\n      ", "\n\n2001 Monetary policy\n"], "doc_type": "St"}, "entity_sentiments": {"economy": {"score": -0.10000000149011612, "magnitude": 0.20000000298023224, "salience": 0.03847425431013107}, "prospects": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.014629737474024296}, "productivity growth": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.013516820967197418}, "terrorist attacks": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.011807176284492016}, "uncertainty": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011807176284492016}}, "paragraph_count": 6, "word_count": 177, "n_gram_count": {"1": 177, "2": 176, "3": 175}, "pos_tags_count": {"noun_count": 37, "verb_count": 4, "adjective_count": 17}, "change_in_vix": null, "change_in_s_n_p_500": null}