{"fomc_doc": {"meeting_date": "2001-06-27", "paragraphs": ["\nFor immediate release\n", "\n\r\nThe Federal Open Market Committee at its meeting today decided to lower its target for the federal funds rate by 25 basis points to 3-3/4 percent.  In a related action, the Board of Governors approved a 25 basis point reduction in the discount rate to 3-1/4 percent.  Today's action by the FOMC brings the decline in the target federal funds rate since the beginning of the year to 275 basis points.  \r\n", "\r\nThe patterns evident in recent months--declining profitability and business capital spending, weak expansion of consumption, and slowing growth abroad--continue to weigh on the economy.  The associated easing of pressures on labor and product markets is expected to keep inflation contained.\r\n", "\r\nAlthough continuing favorable trends bolster long-term prospects for productivity growth and the economy, the Committee continues to believe that against the background of its long-run goals of price stability and sustainable economic growth and of the information currently available, the risks are weighted mainly toward conditions that may generate economic weakness in the foreseeable future.  \r\n", "\r\nIn taking the discount rate action, the Federal Reserve Board approved requests submitted by the Boards of Directors of the Federal Reserve Banks of Boston, New York, Philadelphia, Atlanta, Chicago, Dallas and San Francisco.\r\n", "\n\n2001 Monetary policy\n"], "doc_type": "St"}, "entity_sentiments": {"patterns": {"score": -0.5, "magnitude": 0.5, "salience": 0.01469492632895708}, "profitability": {"score": -0.5, "magnitude": 0.5, "salience": 0.010171638801693916}, "expansion": {"score": -0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.010171638801693916}, "consumption": {"score": -0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.010171638801693916}, "business capital spending": {"score": -0.6000000238418579, "magnitude": 0.6000000238418579, "salience": 0.010171638801693916}, "growth": {"score": -0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.0038345297798514366}}, "paragraph_count": 6, "word_count": 206, "n_gram_count": {"1": 206, "2": 205, "3": 204}, "pos_tags_count": {"noun_count": 49, "verb_count": 5, "adjective_count": 18}, "change_in_vix": null, "change_in_s_n_p_500": null}