{"fomc_doc": {"meeting_date": "2001-04-18", "paragraphs": ["\r\nThe Federal Open Market Committee decided today to lower its target for the federal funds rate by 50 basis points to 4-1/2 percent.  In a related action, the Board of Governors approved a 50 basis point reduction in the discount rate to 4 percent.  \r\n\r\n", "\r\nThe FOMC has reviewed prospects for the economy in light of the information that has become available since its March meeting.  A significant reduction in excess inventories seems well advanced.  Consumption and housing expenditures have held up reasonably well, though activity in these areas has flattened recently.  Although measured productivity probably weakened in the first quarter, the impressive underlying rate of increase that developed in recent years appears to be largely intact.\r\n\r\n", "  \r\nNonetheless, capital investment has continued to soften and the persistent erosion in current and expected profitability, in combination with rising uncertainty about the business outlook, seems poised to dampen capital spending going forward.  This potential restraint, together with the possible effects of earlier reductions in equity wealth on consumption and the risk of slower growth abroad, threatens to keep the pace of economic activity unacceptably weak.  As a consequence, the Committee agreed that an adjustment in the stance of policy is warranted during this extended intermeeting period. \r\n\r\n", "\r\nThe Committee continues to believe that against the\r\nbackground of its long-run goals of price stability and\r\nsustainable economic growth and of the information currently available, the risks are weighted mainly toward conditions that may generate economic weakness in the foreseeable future. \r\n\r\n", " \r\nIn taking the discount rate action, the Federal Reserve Board approved requests submitted by the Boards of Directors of the Federal Reserve Banks of Boston, New York, Philadelphia, Cleveland, Atlanta, Minneapolis, Dallas, and San Francisco.\r\n\r\n\r\n\r\n\r\n\r\n", "\n2001 Monetary policy\n"], "doc_type": "St"}, "entity_sentiments": {"rate": {"score": 0.10000000149011612, "magnitude": 0.30000001192092896, "salience": 0.06327943503856659}, "reduction": {"score": 0.5, "magnitude": 0.5, "salience": 0.018564796075224876}, "inventories": {"score": 0.6000000238418579, "magnitude": 0.6000000238418579, "salience": 0.016528267413377762}, "reductions": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011269177310168743}, "consumption": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011269177310168743}, "growth": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010280152782797813}, "risk": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010280152782797813}, "areas": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.009778602048754692}, "increase": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.009756726212799549}, "productivity": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.009756726212799549}, "pace": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.008185825310647488}}, "paragraph_count": 6, "word_count": 283, "n_gram_count": {"1": 283, "2": 282, "3": 281}, "pos_tags_count": {"noun_count": 59, "verb_count": 7, "adjective_count": 27}, "change_in_vix": null, "change_in_s_n_p_500": null}