{"fomc_doc": {"meeting_date": "2001-01-31", "paragraphs": ["\r\nThe Federal Open Market Committee at its meeting today decided to lower its target for the federal funds rate by 50 basis points to 5-1/2 percent. In a related action, the Board of Governors approved a 50 basis point reduction in the discount rate to 5 percent.  \r\n", "\r\n Consumer and business confidence has eroded further, exacerbated by rising energy costs that continue to drain consumer purchasing power and press on business profit margins.  Partly as a consequence, retail sales and business spending on capital equipment have weakened appreciably. In response, manufacturing production has been cut back sharply, with new technologies appearing to have accelerated the response of production and demand to potential excesses in the stock of inventories and capital equipment.  \r\n", "\r\nTaken together, and with inflation contained, these circumstances have called for a rapid and forceful response of monetary policy.  The longer-term advances in technology and accompanying gains in productivity, however, exhibit few signs of abating and these gains, along with the lower interest rates, should support growth of the economy over time.  \r\n", "\r\nNonetheless, the Committee continues to believe that against the background of its long-run goals of price stability and sustainable economic growth and of the information currently available, the risks are weighted mainly toward conditions that may generate economic weakness in the foreseeable future.  \r\n", "\r\nIn taking the discount rate action, the Federal Reserve Board approved requests submitted by the Boards of Directors of the Federal Reserve Banks of New York, Philadelphia, Cleveland, Atlanta, Chicago, St. Louis, Minneapolis, Dallas and San Francisco.  \r\n", "\n2001 Monetary policy\n"], "doc_type": "St"}, "entity_sentiments": {"energy costs": {"score": -0.6000000238418579, "magnitude": 1.2000000476837158, "salience": 0.043844059109687805}, "Consumer": {"score": -0.6000000238418579, "magnitude": 0.6000000238418579, "salience": 0.014769898727536201}, "consumer purchasing power": {"score": -0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.011841775849461555}, "business confidence": {"score": -0.6000000238418579, "magnitude": 0.6000000238418579, "salience": 0.011841775849461555}, "consequence": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.009940112009644508}, "capital equipment": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.009067989885807037}, "excesses": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.008043174631893635}, "business profit margins": {"score": -0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.007994990795850754}, "business spending": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.007966788485646248}, "retail sales": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007966788485646248}}, "paragraph_count": 6, "word_count": 255, "n_gram_count": {"1": 255, "2": 254, "3": 253}, "pos_tags_count": {"noun_count": 54, "verb_count": 6, "adjective_count": 18}, "change_in_vix": null, "change_in_s_n_p_500": null}