{"fomc_doc": {"meeting_date": "2007-06-28", "paragraphs": ["The Federal Open Market Committee decided today to keep its target for the federal funds rate at 5-1/4 percent. ", "Economic growth appears to have been moderate during the first half of this year, despite the ongoing adjustment in the housing sector. The economy seems likely to continue to expand at a moderate pace over coming quarters.", "Readings on core inflation have improved modestly in recent months. However, a sustained moderation in inflation pressures has yet to be convincingly demonstrated. Moreover, the high level of resource utilization has the potential to sustain those pressures.", "In these circumstances, the Committee's predominant policy concern remains the risk that inflation will fail to moderate as expected. Future policy adjustments will depend on the evolution of the outlook for both inflation and economic growth, as implied by incoming information.", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Thomas M. Hoenig; Donald L. Kohn; Randall S. Kroszner; Cathy E. Minehan; Frederic S. Mishkin; Michael H. Moskow; William Poole; and Kevin M. Warsh."], "doc_type": "St"}, "entity_sentiments": {"economy": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.017341777682304382}, "core inflation": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.015257776714861393}, "resource utilization": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011479070410132408}, "pace": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.011435968801379204}, "Readings": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.011395705863833427}}, "paragraph_count": 5, "word_count": 175, "n_gram_count": {"1": 175, "2": 174, "3": 173}, "pos_tags_count": {"noun_count": 33, "verb_count": 9, "adjective_count": 15}, "change_in_vix": null, "change_in_s_n_p_500": 0.0}