{"fomc_doc": {"meeting_date": "2007-01-31", "paragraphs": ["The Federal Open Market Committee decided today to keep its target for the federal funds rate at 5-1/4 percent. ", "Recent indicators have suggested somewhat firmer economic growth, and some tentative signs of stabilization have appeared in the housing market. Overall, the economy seems likely to expand at a moderate pace over coming quarters. ", "Readings on core inflation have improved modestly in recent months, and inflation pressures seem likely to moderate over time. However, the high level of resource utilization has the potential to sustain inflation pressures. ", "The Committee judges that some inflation risks remain. The extent and timing of any additional firming that may be needed to address these risks will depend on the evolution of the outlook for both inflation and economic growth, as implied by incoming information. ", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Susan S. Bies; Thomas M. Hoenig; Donald L. Kohn; Randall S. Kroszner; Cathy E. Minehan; Frederic S. Mishkin; Michael H. Moskow; William Poole; and Kevin M. Warsh. "], "doc_type": "St"}, "entity_sentiments": {"economy": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.021438557654619217}, "core inflation": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01998838596045971}, "inflation pressures": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.016182791441679}, "pace": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.014135947450995445}, "Readings": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.014086167328059673}}, "paragraph_count": 5, "word_count": 173, "n_gram_count": {"1": 173, "2": 172, "3": 171}, "pos_tags_count": {"noun_count": 30, "verb_count": 7, "adjective_count": 16}, "change_in_vix": null, "change_in_s_n_p_500": 0.7791304347826118}