{"fomc_doc": {"meeting_date": "2007-12-11", "paragraphs": ["The Federal Open Market Committee decided today to lower its target for the federal funds rate 25 basis points to 4-1/4 percent.", "Incoming information suggests that economic growth is slowing, reflecting the intensification of the housing correction and some softening in business and consumer spending. Moreover, strains in financial markets have increased in recent weeks.  Today’s action, combined with the policy actions taken earlier, should help promote moderate growth over time. ", "Readings on core inflation have improved modestly this year, but elevated energy and commodity prices, among other factors, may put upward pressure on inflation.  In this context, the Committee judges that some inflation risks remain, and it will continue to monitor inflation developments carefully.", "Recent developments, including the deterioration in financial market conditions, have increased the uncertainty surrounding the outlook for economic growth and inflation.  The Committee will continue to assess the effects of financial and other developments on economic prospects and will act as needed to foster price stability and sustainable economic growth.", "Voting for the FOMC monetary policy action were:  Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Charles L. Evans; Thomas M. Hoenig; Donald L. Kohn; Randall S. Kroszner; Frederic S. Mishkin; William Poole; and Kevin M. Warsh.  Voting against was Eric S. Rosengren, who preferred to lower the target for the federal funds rate by 50 basis points at this meeting.", "In a related action, the Board of Governors unanimously approved a 25-basis-point decrease in the discount rate to 4-3/4 percent.  In taking this action, the Board approved the requests submitted by the Boards of Directors of the Federal Reserve Banks of New York, Philadelphia, Cleveland, Richmond, Atlanta, Chicago, and St. Louis."], "doc_type": "St"}, "entity_sentiments": {"growth": {"score": -0.10000000149011612, "magnitude": 0.30000001192092896, "salience": 0.0789809450507164}, "markets": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.01266581378877163}, "strains": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.010153668001294136}, "inflation": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.00967352744191885}, "developments": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.008568678982555866}, "outlook": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.006867110263556242}, "uncertainty": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.006867110263556242}, "market conditions": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.006867110263556242}, "deterioration": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004577193409204483}}, "paragraph_count": 6, "word_count": 278, "n_gram_count": {"1": 278, "2": 277, "3": 276}, "pos_tags_count": {"noun_count": 49, "verb_count": 11, "adjective_count": 22}, "change_in_vix": null, "change_in_s_n_p_500": -2.859847204381036}