{"fomc_doc": {"meeting_date": "2007-08-07", "paragraphs": ["The Federal Open Market Committee decided today to keep its target for the federal funds rate at 5-1/4 percent.", "Economic growth was moderate during the first half of the year. Financial markets have been volatile in recent weeks, credit conditions have become tighter for some households and businesses, and the housing correction is ongoing. Nevertheless, the economy seems likely to continue to expand at a moderate pace over coming quarters, supported by solid growth in employment and incomes and a robust global economy.", "Readings on core inflation have improved modestly in recent months. However, a sustained moderation in inflation pressures has yet to be convincingly demonstrated. Moreover, the high level of resource utilization has the potential to sustain those pressures.", "Although the downside risks to growth have increased somewhat, the Committee's predominant policy concern remains the risk that inflation will fail to moderate as expected. Future policy adjustments will depend on the outlook for both inflation and economic growth, as implied by incoming information.", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Thomas M. Hoenig; Donald L. Kohn; Randall S. Kroszner; Frederic S. Mishkin; Michael H. Moskow; William Poole; Eric Rosengren; and Kevin M. Warsh."], "doc_type": "St"}, "entity_sentiments": {"core inflation": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.015076148323714733}, "economy": {"score": 0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.013004940934479237}, "Readings": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.011257530190050602}, "pace": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.011150747537612915}, "incomes": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.011150747537612915}, "employment": {"score": 0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.011150747537612915}, "resource utilization": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010288398712873459}}, "paragraph_count": 5, "word_count": 204, "n_gram_count": {"1": 204, "2": 203, "3": 202}, "pos_tags_count": {"noun_count": 38, "verb_count": 8, "adjective_count": 19}, "change_in_vix": null, "change_in_s_n_p_500": 1.238411044190304}