{"fomc_doc": {"meeting_date": "2008-10-07", "paragraphs": ["Joint Statement by Central Banks\n", "Throughout the current financial crisis, central banks have engaged in continuous close consultation and have cooperated in unprecedented joint actions such as the provision of liquidity to reduce strains in financial markets.", "Inflationary pressures have started to moderate in a number of countries, partly reflecting a marked decline in energy and other commodity prices. Inflation expectations are diminishing and remain anchored to price stability. The recent intensification of the financial crisis has augmented the downside risks to growth and thus has diminished further the upside risks to price stability.  ", "Some easing of global monetary conditions is therefore warranted. Accordingly, the Bank of Canada, the Bank of England, the European Central Bank, the Federal Reserve, Sveriges Riksbank, and the Swiss National Bank are today announcing reductions in policy interest rates. The Bank of Japan expresses its strong support of these policy actions.", "Federal Reserve ActionsThe Federal Open Market Committee has decided to lower its target for the federal funds rate 50 basis points to 1-1/2 percent. The Committee took this action in light of evidence pointing to a weakening of economic activity and a reduction in inflationary pressures.  ", "Incoming economic data suggest that the pace of economic activity has slowed markedly in recent months. Moreover, the intensification of financial market turmoil is likely to exert additional restraint on spending, partly by further reducing the ability of households and businesses to obtain credit. Inflation has been high, but the Committee believes that the decline in energy and other commodity prices and the weaker prospects for economic activity have reduced the upside risks to inflation.  ", "The Committee will monitor economic and financial developments carefully and will act as needed to promote sustainable economic growth and price stability.  ", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Elizabeth A. Duke; Richard W. Fisher; Donald L. Kohn; Randall S. Kroszner; Sandra Pianalto; Charles I. Plosser; Gary H. Stern; and Kevin M. Warsh.  ", "In a related action, the Board of Governors unanimously approved a 50-basis-point decrease in the discount rate to 1-3/4 percent.  In taking this action, the Board approved the request submitted by the Board of Directors of the Federal Reserve Bank of Boston.", "Information on Actions Taken by Other Central BanksInformation on the actions that will be taken by other central banks is available at the following websites:", "Bank of Canada   Bank of England  European Central Bank Sveriges Riksbank (Bank of Sweden) Swiss National Bank (68 KB PDF) ", "Statements by Other Central BanksBank of Japan (79 KB PDF) "], "doc_type": "St"}, "entity_sentiments": {"banks": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.06745569407939911}, "pressures": {"score": -0.10000000149011612, "magnitude": 0.30000001192092896, "salience": 0.054051194339990616}, "markets": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.04284817352890968}, "Joint Statement": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03913307189941406}, "crisis": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03913307189941406}, "provision": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03443008288741112}, "liquidity": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03443008288741112}, "consultation": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03443008288741112}, "number": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.01661810278892517}, "countries": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01661810278892517}, "Bank of Japan": {"score": 0.20000000298023224, "magnitude": 0.5, "salience": 0.013634787872433662}, "price stability": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.0078006102703511715}, "downside risks": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.0078006102703511715}, "policy actions": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.007619321346282959}, "Inflation expectations": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006273508537560701}, "data": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004222507122904062}, "pace": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004222507122904062}, "support": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004189230967313051}, "growth": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.0014524614671245217}}, "paragraph_count": 12, "word_count": 427, "n_gram_count": {"1": 427, "2": 426, "3": 425}, "pos_tags_count": {"noun_count": 62, "verb_count": 10, "adjective_count": 51}, "change_in_vix": null, "change_in_s_n_p_500": -6.807957612716187}