{"fomc_doc": {"meeting_date": "2008-06-25", "paragraphs": ["The Federal Open Market Committee decided today to keep its target for the federal funds rate at 2 percent.", "Recent information indicates that overall economic activity continues to expand, partly reflecting some firming in household spending.  However, labor markets have softened further and financial markets remain under considerable stress.  Tight credit conditions, the ongoing housing contraction, and the rise in energy prices are likely to weigh on economic growth over the next few quarters.", "The Committee expects inflation to moderate later this year and next year.  However, in light of the continued increases in the prices of energy and some other commodities and the elevated state of some indicators of inflation expectations, uncertainty about the inflation outlook remains high.", "The substantial easing of monetary policy to date, combined with ongoing measures to foster market liquidity, should help to promote moderate growth over time.  Although downside risks to growth remain, they appear to have diminished somewhat, and the upside risks to inflation and inflation expectations have increased.  The Committee will continue to monitor economic and financial developments and will act as needed to promote sustainable economic growth and price stability.", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; Timothy F. Geithner, Vice Chairman; Donald L. Kohn; Randall S. Kroszner; Frederic S. Mishkin; Sandra Pianalto; Charles I. Plosser; Gary H. Stern; and Kevin M. Warsh.  Voting against was Richard W. Fisher, who preferred an increase in the target for the federal funds rate at this meeting."], "doc_type": "St"}, "entity_sentiments": {"markets": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.021481255069375038}, "labor markets": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.017448512837290764}, "easing": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.014940769411623478}, "stress": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01303207129240036}, "commodities": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011833259835839272}, "growth": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011747285723686218}, "uncertainty": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010883077047765255}, "energy": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010053928010165691}, "increases": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.009931288659572601}, "state": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.008833502419292927}, "indicators": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.008833502419292927}}, "paragraph_count": 5, "word_count": 248, "n_gram_count": {"1": 248, "2": 247, "3": 246}, "pos_tags_count": {"noun_count": 47, "verb_count": 12, "adjective_count": 27}, "change_in_vix": null, "change_in_s_n_p_500": 0.06828010014414947}