{"fomc_doc": {"meeting_date": "2009-01-28", "paragraphs": ["The Federal Open Market Committee decided today to keep its target range for the federal funds rate at 0 to 1/4 percent. The Committee continues to anticipate that economic conditions are likely to warrant exceptionally low levels of the federal funds rate for some time.", "Information received since the Committee met in December suggests that the economy has weakened further. Industrial production, housing starts, and employment have continued to decline steeply, as consumers and businesses have cut back spending. Furthermore, global demand appears to be slowing significantly. Conditions in some financial markets have improved, in part reflecting government efforts to provide liquidity and strengthen financial institutions; nevertheless, credit conditions for households and firms remain extremely tight. The Committee anticipates that a gradual recovery in economic activity will begin later this year, but the downside risks to that outlook are significant.", "In light of the declines in the prices of energy and other commodities in recent months and the prospects for considerable economic slack, the Committee expects that inflation pressures will remain subdued in coming quarters. Moreover, the Committee sees some risk that inflation could persist for a time below rates that best foster economic growth and price stability in the longer term.", "The Federal Reserve will employ all available tools to promote the resumption of sustainable economic growth and to preserve price stability. The focus of the Committee's policy is to support the functioning of financial markets and stimulate the economy through open market operations and other measures that are likely to keep the size of the Federal Reserve's balance sheet at a high level. The Federal Reserve continues to purchase large quantities of agency debt and mortgage-backed securities to provide support to the mortgage and housing markets, and it stands ready to expand the quantity of such purchases and the duration of the purchase program as conditions warrant. The Committee also is prepared to purchase longer-term Treasury securities if evolving circumstances indicate that such transactions would be particularly effective in improving conditions in private credit markets. The Federal Reserve will be implementing the Term Asset-Backed Securities Loan Facility to facilitate the extension of credit to households and small businesses. The Committee will continue to monitor carefully the size and composition of the Federal Reserve's balance sheet in light of evolving financial market developments and to assess whether expansions of or modifications to lending facilities would serve to further support credit markets and economic activity and help to preserve price stability.", "Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; William C. Dudley, Vice Chairman; Elizabeth A. Duke; Charles L. Evans; Donald L. Kohn; Dennis P. Lockhart; Kevin M. Warsh; and Janet L. Yellen.  Voting against was Jeffrey M. Lacker, who preferred to expand the monetary base at this time by purchasing U.S. Treasury securities rather than through targeted credit programs."], "doc_type": "St"}, "entity_sentiments": {"Federal Reserve": {"score": 0.10000000149011612, "magnitude": 0.6000000238418579, "salience": 0.04725256562232971}, "production": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.008676527068018913}, "back spending": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.00704154884442687}, "businesses": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006748655810952187}, "consumers": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.005928628146648407}, "housing starts": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.005928628146648407}, "employment": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005928628146648407}, "demand": {"score": -0.5, "magnitude": 0.5, "salience": 0.005912390537559986}, "price stability": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004997755866497755}, "purchases": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004173228517174721}, "quantities": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004173228517174721}, "mortgage": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004173228517174721}, "resumption": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.00400429405272007}, "tools": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.00400429405272007}, "declines": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.003966215066611767}, "support": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.003183760680258274}, "conditions": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.001719426247291267}, "purchase program": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0013786570634692907}, "duration": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0012108399532735348}, "extension": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.001208544010296464}, "Term Asset-Backed Securities Loan Facility": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0008130093337967992}}, "paragraph_count": 5, "word_count": 474, "n_gram_count": {"1": 474, "2": 473, "3": 472}, "pos_tags_count": {"noun_count": 77, "verb_count": 28, "adjective_count": 43}, "change_in_vix": null, "change_in_s_n_p_500": 1.1328527291452053}