{"fomc_doc": {"meeting_date": "2011-12-13", "paragraphs": ["\n       Information received since the Federal Open Market Committee met in November suggests that the economy has been expanding moderately, notwithstanding some apparent slowing in global growth. While indicators point to some improvement in overall labor market conditions, the unemployment rate remains elevated. Household spending has continued to advance, but business fixed investment appears to be increasing less rapidly and the housing sector remains depressed. Inflation has moderated since earlier in the year, and longer-term inflation expectations have remained stable.\n    ", "\n       Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. The Committee continues to expect a moderate pace of economic growth over coming quarters and consequently anticipates that the unemployment rate will decline only gradually toward levels that the Committee judges to be consistent with its dual mandate. Strains in global financial markets continue to pose significant downside risks to the economic outlook. The Committee also anticipates that inflation will settle, over coming quarters, at levels at or below those consistent with the Committee’s dual mandate. However, the Committee will continue to pay close attention to the evolution of inflation and inflation expectations.\n    ", "\n       To support a stronger economic recovery and to help ensure that inflation, over time, is at levels consistent with the dual mandate, the Committee decided today to continue its program to extend the average maturity of its holdings of securities as announced in September. The Committee is maintaining its existing policies of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed securities in agency mortgage-backed securities and of rolling over maturing Treasury securities at auction. The Committee will regularly review the size and composition of its securities holdings and is prepared to adjust those holdings as appropriate.\n    ", "\n       The Committee also decided to keep the target range for the federal funds rate at 0 to 1/4 percent and currently anticipates that economic conditions--including low rates of resource utilization and a subdued outlook for inflation over the medium run--are likely to warrant exceptionally low levels for the federal funds rate at least through mid-2013.\n    ", "\n       The Committee will continue to assess the economic outlook in light of incoming information and is prepared to employ its tools to promote a stronger economic recovery in a context of price stability.\n    ", "\n       Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; William C. Dudley, Vice Chairman; Elizabeth A. Duke; Richard W. Fisher; Narayana Kocherlakota; Charles I. Plosser; Sarah Bloom Raskin; Daniel K. Tarullo; and Janet L. Yellen. Voting against the action was Charles L. Evans, who supported additional policy accommodation at this time.\n    "], "doc_type": "St"}, "entity_sentiments": {"Committee": {"score": 0.20000000298023224, "magnitude": 0.4000000059604645, "salience": 0.0659475326538086}, "Household spending": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.028579602017998695}, "indicators": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.021423636004328728}, "investment": {"score": -0.5, "magnitude": 0.5, "salience": 0.019568195566534996}, "business": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.019568195566534996}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.009887149557471275}, "housing sector": {"score": -0.5, "magnitude": 0.5, "salience": 0.00914973858743906}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.008399216458201408}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007378911133855581}, "Strains": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007258723955601454}, "markets": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.006188548170030117}, "downside risks": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004958597477525473}}, "paragraph_count": 6, "word_count": 429, "n_gram_count": {"1": 429, "2": 428, "3": 427}, "pos_tags_count": {"noun_count": 75, "verb_count": 23, "adjective_count": 41}, "change_in_vix": 1.5759665107116487, "change_in_s_n_p_500": -1.4709467696058531}