{"fomc_doc": {"meeting_date": "2011-04-27", "paragraphs": ["\n       Information received since the Federal Open Market Committee met in March indicates that the economic recovery is proceeding at a moderate pace and overall conditions in the labor market are improving gradually.  Household spending and business investment in equipment and software continue to expand.  However, investment in nonresidential structures is still weak, and the housing sector continues to be depressed.  Commodity prices have risen significantly since last summer, and concerns about global supplies of crude oil have contributed to a further increase in oil prices since the Committee met in March.  Inflation has picked up in recent months, but longer-term inflation expectations have remained stable and measures of underlying inflation are still subdued.\n    ", "\n       Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability.  The unemployment rate remains elevated, and measures of underlying inflation continue to be somewhat low, relative to levels that the Committee judges to be consistent, over the longer run, with its dual mandate.  Increases in the prices of energy and other commodities have pushed up inflation in recent months.  The Committee expects these effects to be transitory, but it will pay close attention to the evolution of inflation and inflation expectations.  The Committee continues to anticipate a gradual return to higher levels of resource utilization in a context of price stability.\n    ", "\n       To promote a stronger pace of economic recovery and to help ensure that inflation, over time, is at levels consistent with its mandate, the Committee decided today to continue expanding its holdings of securities as announced in November.  In particular, the Committee is maintaining its existing policy of reinvesting principal payments from its securities holdings and will complete purchases of $600 billion of longer-term Treasury securities by the end of the current quarter.  The Committee will regularly review the size and composition of its securities holdings in light of incoming information and is prepared to adjust those holdings as needed to best foster maximum employment and price stability.\n    ", "\n       The Committee will maintain the target range for the federal funds rate at 0 to 1/4 percent and continues to anticipate that economic conditions, including low rates of resource utilization, subdued inflation trends, and stable inflation expectations, are likely to warrant exceptionally low levels for the federal funds rate for an extended period. \n    ", "\n       The Committee will continue to monitor the economic outlook and financial developments and will employ its policy tools as necessary to support the economic recovery and to help ensure that inflation, over time, is at levels consistent with its mandate.\n    ", "\n       Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; William C. Dudley, Vice Chairman; Elizabeth A. Duke; Charles L. Evans; Richard W. Fisher; Narayana Kocherlakota; Charles I. Plosser; Sarah Bloom Raskin; Daniel K. Tarullo; and Janet L. Yellen.\n    "], "doc_type": "St"}, "entity_sentiments": {"labor market": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.029348226264119148}, "Information": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.029348226264119148}, "conditions": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.029348226264119148}, "Committee": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.028548261150717735}, "Household spending": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01820083148777485}, "housing sector": {"score": -0.5, "magnitude": 0.5, "salience": 0.018110960721969604}, "investment": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01694316789507866}, "equipment": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.012459049932658672}, "business": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.012459049932658672}, "software": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.012459049932658672}, "structures": {"score": -0.5, "magnitude": 0.5, "salience": 0.01239735633134842}, "Commodity prices": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006991536822170019}, "oil prices": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006991536822170019}, "concerns": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0068579199723899364}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.006248302757740021}, "crude oil": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005334271118044853}, "increase": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005334271118044853}, "supplies": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004686156753450632}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.003581713419407606}, "Increases": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0035690655931830406}, "energy": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0031350927893072367}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.0011937390081584454}}, "paragraph_count": 6, "word_count": 461, "n_gram_count": {"1": 461, "2": 460, "3": 459}, "pos_tags_count": {"noun_count": 77, "verb_count": 26, "adjective_count": 44}, "change_in_vix": -1.6218523260776738, "change_in_s_n_p_500": 0.4569912287167216}