{"fomc_doc": {"meeting_date": "2012-10-24", "paragraphs": ["\n       Information received since the Federal Open Market Committee met in September suggests that economic activity has continued to expand at a moderate pace in recent months.  Growth in employment has been slow, and the unemployment rate remains elevated.  Household spending has advanced a bit more quickly, but growth in business fixed investment has slowed.  The housing sector has shown some further signs of improvement, albeit from a depressed level.  Inflation recently picked up somewhat, reflecting higher energy prices.  Longer-term inflation expectations have remained stable.\n    ", "\n       Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability.  The Committee remains concerned that, without sufficient policy accommodation, economic growth might not be strong enough to generate sustained improvement in labor market conditions.  Furthermore, strains in global financial markets continue to pose significant downside risks to the economic outlook.  The Committee also anticipates that inflation over the medium term likely would run at or below its 2 percent objective.\n    ", "\n       To support a stronger economic recovery and to help ensure that inflation, over time, is at the rate most consistent with its dual mandate, the Committee will continue purchasing additional agency mortgage-backed securities at a pace of $40 billion per month.  The Committee also will continue through the end of the year its program to extend the average maturity of its holdings of Treasury securities, and it is maintaining its existing policy of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed  securities in agency mortgage-backed securities.  These actions, which together will increase the Committee’s holdings of longer-term securities by about $85 billion each month through the end of the year, should put downward pressure on longer-term interest rates, support mortgage markets, and help to make broader financial conditions more accommodative.\n    ", "\n       The Committee will closely monitor incoming information on economic and financial developments in coming months.  If the outlook for the labor market does not improve substantially, the Committee will continue its purchases of agency mortgage-backed securities, undertake additional asset purchases, and employ its other policy tools as appropriate until such improvement is achieved in a context of price stability.  In determining the size, pace, and composition of its asset purchases, the Committee will, as always, take appropriate account of the likely efficacy and costs of such purchases.\n    ", "\n       To support continued progress toward maximum employment and price stability, the Committee expects that a highly accommodative stance of monetary policy will remain appropriate for a considerable time after the economic recovery strengthens.  In particular, the Committee also decided today to keep the target range for the federal funds rate at 0 to 1/4 percent and currently anticipates that exceptionally low levels for the federal funds rate are likely to be warranted at least through mid-2015.\n    ", "\n       Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; William C. Dudley, Vice Chairman; Elizabeth A. Duke; Dennis P. Lockhart; Sandra Pianalto; Jerome H. Powell; Sarah Bloom Raskin; Jeremy C. Stein; Daniel K. Tarullo; John C. Williams; and Janet L. Yellen.  Voting against the action was Jeffrey M. Lacker, who opposed additional asset purchases and disagreed with the description of the time period over which a highly accommodative stance of monetary policy will remain appropriate and exceptionally low levels for the federal funds rate are likely to be warranted.\n    "], "doc_type": "St"}, "entity_sentiments": {"Committee": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.06168051064014435}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.026989858597517014}, "Growth": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.024149302393198013}, "unemployment rate": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.02259678766131401}, "Household spending": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.012264817953109741}, "business": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.012264817953109741}, "housing sector": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.010168967768549919}, "growth": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0070653934963047504}, "strains": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.006715177092701197}, "markets": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.006517228204756975}, "energy prices": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006193122826516628}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005743252579122782}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005238895770162344}, "policy accommodation": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005230305250734091}, "labor market conditions": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005230305250734091}, "outlook": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.005222739651799202}, "downside risks": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004587988834828138}, "account": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0012293268227949739}}, "paragraph_count": 6, "word_count": 548, "n_gram_count": {"1": 548, "2": 547, "3": 546}, "pos_tags_count": {"noun_count": 101, "verb_count": 27, "adjective_count": 64}, "change_in_vix": 2.1347801835606734, "change_in_s_n_p_500": -0.6452985392142934}