{"fomc_doc": {"meeting_date": "2012-01-25", "paragraphs": ["\n       Information received since the Federal Open Market Committee met in December suggests that the economy has been expanding moderately, notwithstanding some slowing in global growth. While indicators point to some further improvement in overall labor market conditions, the unemployment rate remains elevated. Household spending has continued to advance, but growth in business fixed investment has slowed, and the housing sector remains depressed. Inflation has been subdued in recent months, and longer-term inflation expectations have remained stable.\n    ", "\n       Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. The Committee expects economic growth over coming quarters to be modest and consequently anticipates that the unemployment rate will decline only gradually toward levels that the Committee judges to be consistent with its dual mandate. Strains in global financial markets continue to pose significant downside risks to the economic outlook. The Committee also anticipates that over coming quarters, inflation will run at levels at or below those consistent with the Committee's dual mandate.\n    ", "\n       To support a stronger economic recovery and to help ensure that inflation, over time, is at levels consistent with the dual mandate, the Committee expects to maintain a highly accommodative stance for monetary policy.  In particular, the Committee decided today to keep the target range for the federal funds rate at 0 to 1/4 percent and currently anticipates that economic conditions--including low rates of resource utilization and a subdued outlook for inflation over the medium run--are likely to warrant exceptionally low levels for the federal funds rate at least through late 2014.\n    ", "\n       The Committee also decided to continue its program to extend the average maturity of its holdings of securities as announced in September. The Committee is maintaining its existing policies of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed securities in agency mortgage-backed securities and of rolling over maturing Treasury securities at auction. The Committee will regularly review the size and composition of its securities holdings and is prepared to adjust those holdings as appropriate to promote a stronger economic recovery in a context of price stability.\n    ", "\n       Voting for the FOMC monetary policy action were: Ben S. Bernanke, Chairman; William C. Dudley, Vice Chairman; Elizabeth A. Duke; Dennis P. Lockhart; Sandra Pianalto; Sarah Bloom Raskin; Daniel K. Tarullo; John C. Williams; and Janet L. Yellen.  Voting against the action was Jeffrey M. Lacker, who preferred to omit the description of the time period over which economic conditions are likely to warrant exceptionally low levels of the federal funds rate.\n    "], "doc_type": "St"}, "entity_sentiments": {"Committee": {"score": 0.20000000298023224, "magnitude": 0.4000000059604645, "salience": 0.06970556080341339}, "Household spending": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.030994201079010963}, "growth": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.026454739272594452}, "indicators": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.02323651686310768}, "business": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.021224748343229294}, "investment": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.021224748343229294}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.010725939646363258}, "housing sector": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.009926095604896545}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.00800525676459074}, "Strains": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007874884642660618}, "markets": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.006713990122079849}, "outlook": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005663828458636999}, "stance": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005429478362202644}, "downside risks": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005379723384976387}}, "paragraph_count": 5, "word_count": 418, "n_gram_count": {"1": 418, "2": 417, "3": 416}, "pos_tags_count": {"noun_count": 68, "verb_count": 20, "adjective_count": 48}, "change_in_vix": -4.390243902439031, "change_in_s_n_p_500": 0.9806879903440038}