{"fomc_doc": {"meeting_date": "2015-01-28", "paragraphs": ["\n       Information received since the Federal Open Market Committee met in December suggests that economic activity has been expanding at a solid pace.  Labor market conditions have improved further, with strong job gains and a lower unemployment rate.  On balance, a range of labor market indicators suggests that underutilization of labor resources continues to diminish.  Household spending is rising moderately; recent declines in energy prices have boosted household purchasing power.  Business fixed investment is advancing, while the recovery in the housing sector remains slow.  Inflation has declined further below the Committee’s longer-run objective, largely reflecting declines in energy prices.  Market-based measures of inflation compensation have declined substantially in recent months; survey-based measures of longer-term inflation expectations have remained stable.\n    ", "\n       Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability.  The Committee expects that, with appropriate policy accommodation, economic activity will expand at a moderate pace, with labor market indicators continuing to move toward levels the Committee judges consistent with its dual mandate.  The Committee continues to see the risks to the outlook for economic activity and the labor market as nearly balanced.  Inflation is anticipated to decline further in the near term, but the Committee expects inflation to rise gradually toward 2 percent over the medium term as the labor market improves further and the transitory effects of lower energy prices and other factors dissipate.  The Committee continues to monitor inflation developments closely.\n    ", "\n       To support continued progress toward maximum employment and price stability, the Committee today reaffirmed its view that the current 0 to 1/4 percent target range for the federal funds rate remains appropriate.  In determining how long to maintain this target range, the Committee will assess progress--both realized and expected--toward its objectives of maximum employment and 2 percent inflation.  This assessment will take into account a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, and readings on financial and international developments.  Based on its current assessment, the Committee judges that it can be patient in beginning to normalize the stance of monetary policy.  However, if incoming information indicates faster progress toward the Committee’s employment and inflation objectives than the Committee now expects, then increases in the target range for the federal funds rate are likely to occur sooner than currently anticipated.  Conversely, if progress proves slower than expected, then increases in the target range are likely to occur later than currently anticipated.\n    ", "\n       The Committee is maintaining its existing policy of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed securities in agency mortgage-backed securities and of rolling over maturing Treasury securities at auction.  This policy, by keeping the Committee’s holdings of longer-term securities at sizable levels, should help maintain accommodative financial conditions.\n    ", "\n       When the Committee decides to begin to remove policy accommodation, it will take a balanced approach consistent with its longer-run goals of maximum employment and inflation of 2 percent.  The Committee currently anticipates that, even after employment and inflation are near mandate-consistent levels, economic conditions may, for some time, warrant keeping the target federal funds rate below levels the Committee views as normal in the longer run.\n    ", "\n       Voting for the FOMC monetary policy action were: Janet L. Yellen, Chair; William C. Dudley, Vice Chairman; Lael Brainard; Charles L. Evans; Stanley Fischer; Jeffrey M. Lacker; Dennis P. Lockhart; Jerome H. Powell; Daniel K. Tarullo; and John C. Williams.\n    "], "doc_type": "St"}, "entity_sentiments": {"price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.014074060134589672}, "unemployment rate": {"score": 0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.013123284094035625}, "Labor market conditions": {"score": 0.800000011920929, "magnitude": 0.800000011920929, "salience": 0.013123284094035625}, "Committee": {"score": 0.20000000298023224, "magnitude": 0.4000000059604645, "salience": 0.012868337333202362}, "job gains": {"score": 0.699999988079071, "magnitude": 0.699999988079071, "salience": 0.009801134467124939}, "Household spending": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.009718187153339386}, "investment": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.00969163328409195}, "Business": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.00969163328409195}, "Inflation": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005611640866845846}, "objective": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.00457358593121171}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004557441920042038}, "recovery": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.004526634234935045}, "housing sector": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.003672870108857751}}, "paragraph_count": 6, "word_count": 567, "n_gram_count": {"1": 567, "2": 566, "3": 565}, "pos_tags_count": {"noun_count": 109, "verb_count": 22, "adjective_count": 58}, "change_in_vix": 10.066339775021637, "change_in_s_n_p_500": -2.0135904866593393}