{"fomc_doc": {"meeting_date": "2016-12-14", "paragraphs": ["Information received since the Federal Open Market Committee met in November indicates that the labor market has continued to strengthen and that economic activity has been expanding at a moderate pace since mid-year. Job gains have been solid in recent months and the unemployment rate has declined. Household spending has been rising moderately but business fixed investment has remained soft. Inflation has increased since earlier this year but is still below the Committee's 2 percent longer-run objective, partly reflecting earlier declines in energy prices and in prices of non-energy imports. Market-based measures of inflation compensation have moved up considerably but still are low; most survey-based measures of longer-term inflation expectations are little changed, on balance, in recent months.", "Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. The Committee expects that, with gradual adjustments in the stance of monetary policy, economic activity will expand at a moderate pace and labor market conditions will strengthen somewhat further. Inflation is expected to rise to 2 percent over the medium term as the transitory effects of past declines in energy and import prices dissipate and the labor market strengthens further. Near-term risks to the economic outlook appear roughly balanced. The Committee continues to closely monitor inflation indicators and global economic and financial developments.", "In view of realized and expected labor market conditions and inflation, the Committee decided to raise the target range for the federal funds rate to 1/2 to 3/4 percent. The stance of monetary policy remains accommodative, thereby supporting some further strengthening in labor market conditions and a return to 2 percent inflation.", "In determining the timing and size of future adjustments to the target range for the federal funds rate, the Committee will assess realized and expected economic conditions relative to its objectives of maximum employment and 2 percent inflation. This assessment will take into account a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, and readings on financial and international developments. In light of the current shortfall of inflation from 2 percent, the Committee will carefully monitor actual and expected progress toward its inflation goal. The Committee expects that economic conditions will evolve in a manner that will warrant only gradual increases in the federal funds rate; the federal funds rate is likely to remain, for some time, below levels that are expected to prevail in the longer run. However, the actual path of the federal funds rate will depend on the economic outlook as informed by incoming data.", "The Committee is maintaining its existing policy of reinvesting principal payments from its holdings of agency debt and agency mortgage-backed securities in agency mortgage-backed securities and of rolling over maturing Treasury securities at auction, and it anticipates doing so until normalization of the level of the federal funds rate is well under way. This policy, by keeping the Committee's holdings of longer-term securities at sizable levels, should help maintain accommodative financial conditions.", "Voting for the FOMC monetary policy action were: Janet L. Yellen, Chair; William C. Dudley, Vice Chairman; Lael Brainard; James Bullard; Stanley Fischer; Esther L. George; Loretta J. Mester; Jerome H. Powell; Eric Rosengren; and Daniel K. Tarullo.", "Implementation Note issued December 14, 2016"], "doc_type": "St"}, "entity_sentiments": {"Inflation": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.02547615021467209}, "stance": {"score": 0.10000000149011612, "magnitude": 0.20000000298023224, "salience": 0.02491590939462185}, "Job gains": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.022281471639871597}, "Committee": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.020397601649165154}, "unemployment rate": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.018558066338300705}, "investment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.017360994592308998}, "Household spending": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.014097931794822216}, "business": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.014097931794822216}, "energy prices": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.007137706037610769}, "inflation": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006528940983116627}, "objective": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006062888074666262}, "declines": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006062888074666262}, "imports": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.006062888074666262}, "employment": {"score": 0.10000000149011612, "magnitude": 0.20000000298023224, "salience": 0.006032749079167843}, "labor market conditions": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0055966442450881}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005299514625221491}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005299514625221491}, "monetary policy": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.005070679821074009}, "strengthening": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.003588906954973936}}, "paragraph_count": 7, "word_count": 541, "n_gram_count": {"1": 541, "2": 540, "3": 539}, "pos_tags_count": {"noun_count": 99, "verb_count": 17, "adjective_count": 63}, "change_in_vix": -0.9122006841505208, "change_in_s_n_p_500": -0.6773508057375602}