{"fomc_doc": {"meeting_date": "2018-01-31", "paragraphs": ["Information received since the Federal Open Market Committee met in December indicates that the labor market has continued to strengthen and that economic activity has been rising at a solid rate. Gains in employment, household spending, and business fixed investment have been solid, and the unemployment rate has stayed low. On a 12-month basis, both overall inflation and inflation for items other than food and energy have continued to run below 2 percent. Market-based measures of inflation compensation have increased in recent months but remain low; survey-based measures of longer-term inflation expectations are little changed, on balance.", "Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. The Committee expects that, with further gradual adjustments in the stance of monetary policy, economic activity will expand at a moderate pace and labor market conditions will remain strong. Inflation on a 12‑month basis is expected to move up this year and to stabilize around the Committee's 2 percent objective over the medium term. Near-term risks to the economic outlook appear roughly balanced, but the Committee is monitoring inflation developments closely.", "In view of realized and expected labor market conditions and inflation, the Committee decided to maintain the target range for the federal funds rate at 1-1/4 to 1‑1/2 percent. The stance of monetary policy remains accommodative, thereby supporting strong labor market conditions and a sustained return to 2 percent inflation.", "In determining the timing and size of future adjustments to the target range for the federal funds rate, the Committee will assess realized and expected economic conditions relative to its objectives of maximum employment and 2 percent inflation. This assessment will take into account a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, and readings on financial and international developments. The Committee will carefully monitor actual and expected inflation developments relative to its symmetric inflation goal. The Committee expects that economic conditions will evolve in a manner that will warrant further gradual increases in the federal funds rate; the federal funds rate is likely to remain, for some time, below levels that are expected to prevail in the longer run. However, the actual path of the federal funds rate will depend on the economic outlook as informed by incoming data.", "Voting for the FOMC monetary policy action were Janet L. Yellen, Chair; William C. Dudley, Vice Chairman; Thomas I. Barkin; Raphael W. Bostic; Lael Brainard; Loretta J. Mester; Jerome H. Powell; Randal K. Quarles; and John C. Williams.", "Implementation Note issued January 31, 2018"], "doc_type": "St"}, "entity_sentiments": {"labor market": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.07884906232357025}, "rate": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.05437606945633888}, "Information": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.03995620831847191}, "stance": {"score": 0.10000000149011612, "magnitude": 0.30000001192092896, "salience": 0.028294164687395096}, "Gains": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.026678914204239845}, "unemployment rate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.02636982873082161}, "employment": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0211653895676136}, "basis": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.019221611320972443}, "household spending": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.016980931162834167}, "business": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.016980931162834167}, "investment": {"score": 0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.016980931162834167}, "Committee": {"score": 0.20000000298023224, "magnitude": 0.4000000059604645, "salience": 0.016842786222696304}, "inflation": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.011932358145713806}, "energy": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.006412786897271872}, "food": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.006412786897271872}, "items": {"score": -0.4000000059604645, "magnitude": 0.4000000059604645, "salience": 0.006412786897271872}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.006372665986418724}, "monetary policy": {"score": 0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.004942990839481354}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004300301894545555}, "return": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.003960527013987303}}, "paragraph_count": 6, "word_count": 426, "n_gram_count": {"1": 426, "2": 425, "3": 424}, "pos_tags_count": {"noun_count": 85, "verb_count": 16, "adjective_count": 51}, "change_in_vix": 0.06675567423230833, "change_in_s_n_p_500": -0.2944306491663856}