{"fomc_doc": {"meeting_date": "2019-07-31", "paragraphs": ["Information received since the Federal Open Market Committee met in June indicates that the labor market remains strong and that economic activity has been rising at a moderate rate. Job gains have been solid, on average, in recent months, and the unemployment rate has remained low. Although growth of household spending has picked up from earlier in the year, growth of business fixed investment has been soft. On a 12-month basis, overall inflation and inflation for items other than food and energy are running below 2 percent. Market-based measures of inflation compensation remain low; survey-based measures of longer-term inflation expectations are little changed.", "Consistent with its statutory mandate, the Committee seeks to foster maximum employment and price stability. In light of the implications of global developments for the economic outlook as well as muted inflation pressures, the Committee decided to lower the target range for the federal funds rate to 2 to 2-1/4 percent. This action supports the Committee's view that sustained expansion of economic activity, strong labor market conditions, and inflation near the Committee's symmetric 2 percent objective are the most likely outcomes, but uncertainties about this outlook remain. As the Committee contemplates the future path of the target range for the federal funds rate, it will continue to monitor the implications of incoming information for the economic outlook and will act as appropriate to sustain the expansion, with a strong labor market and inflation near its symmetric 2 percent objective.", "In determining the timing and size of future adjustments to the target range for the federal funds rate, the Committee will assess realized and expected economic conditions relative to its maximum employment objective and its symmetric 2 percent inflation objective. This assessment will take into account a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, and readings on financial and international developments.", "The Committee will conclude the reduction of its aggregate securities holdings in the System Open Market Account in August, two months earlier than previously indicated.", "Voting for the monetary policy action were Jerome H. Powell, Chair; John C. Williams, Vice Chair; Michelle W. Bowman; Lael Brainard; James Bullard; Richard H. Clarida; Charles L. Evans; and Randal K. Quarles. Voting against the action were Esther L. George and Eric S. Rosengren, who preferred at this meeting to maintain the target range for the federal funds rate at 2-1/4 to 2-1/2 percent.", "Implementation Note issued July 31, 2019"], "doc_type": "St"}, "entity_sentiments": {"Committee": {"score": 0.10000000149011612, "magnitude": 0.5, "salience": 0.06847108900547028}, "activity": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.055220168083906174}, "Job gains": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.029649987816810608}, "inflation": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.026672687381505966}, "average": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.01887199655175209}, "items": {"score": -0.30000001192092896, "magnitude": 0.30000001192092896, "salience": 0.007101795636117458}, "energy": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007101795636117458}, "basis": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007101795636117458}, "food": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.007101795636117458}, "objective": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.00644722580909729}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.00542841712012887}, "view": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004810449201613665}, "mandate": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004768498707562685}, "price stability": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.004768498707562685}}, "paragraph_count": 6, "word_count": 409, "n_gram_count": {"1": 409, "2": 408, "3": 407}, "pos_tags_count": {"noun_count": 85, "verb_count": 10, "adjective_count": 46}, "change_in_vix": 5.426027977956767, "change_in_s_n_p_500": -1.1969202837642479}