{"fomc_doc": {"meeting_date": "2020-03-23", "paragraphs": ["The Federal Reserve is committed to use its full range of tools to support the U.S. economy in this challenging time and thereby promote its maximum employment and price stability goals.", "The Federal Open Market Committee is taking further actions to support the flow of credit to households and businesses by addressing strains in the markets for Treasury securities and agency mortgage-backed securities. The Federal Reserve will continue to purchase Treasury securities and agency mortgage-backed securities in the amounts needed to support smooth market functioning and effective transmission of monetary policy to broader financial conditions. The Committee will include purchases of agency commercial mortgage-backed securities in its agency mortgage-backed security purchases. In addition, the Open Market Desk will continue to offer large-scale overnight and term repurchase agreement operations. The Committee will continue to closely monitor market conditions, and will assess the appropriate pace of its securities purchases at future meetings.", "Voting (by notation) for the monetary policy action were Jerome H. Powell, Chair; John C. Williams, Vice Chair; Michelle W. Bowman; Lael Brainard; Richard H. Clarida; Patrick Harker; Robert S. Kaplan; Neel Kashkari; Loretta J. Mester; and Randal K. Quarles.", "In a related set of actions, the Federal Reserve announced additional measures to support the flow of credit to households and businesses. More information can be found on the Federal Reserve Board's website.", "In connection with these plans, the Committee voted unanimously to authorize and direct the Federal Reserve Bank of New York, until instructed otherwise, to execute transactions in the System Open Market Account in accordance with the following domestic policy directive:", "\"Effective March 23, 2020, the Federal Open Market Committee directs the Desk to undertake open market operations as necessary to maintain the federal funds rate in a target range of 0 to 1/4 percent. The Committee directs the Desk to increase the System Open Market Account holdings of Treasury securities and agency mortgage-backed securities (MBS) in the amounts needed to support the smooth functioning of markets for Treasury securities and agency MBS. The Committee also directs the Desk to include purchases of agency commercial mortgage-backed securities in its agency mortgage-backed security purchases.", "The Committee also directs the Desk to continue conducting term and overnight repurchase agreement operations to ensure that the supply of reserves remains ample and to support the smooth functioning of short-term U.S. dollar funding markets. In addition, the Committee directs the Desk to conduct overnight reverse repurchase operations (and reverse repurchase operations with maturities of more than one day when necessary to accommodate weekend, holiday, or similar trading conventions) at an offering rate of 0.00 percent, in amounts limited only by the value of Treasury securities held outright in the System Open Market Account that are available for such operations and by a per-counterparty limit of $30 billion per day.", "The Committee directs the Desk to continue rolling over at auction all principal payments from the Federal Reserve's holdings of Treasury securities and to reinvest all principal payments from the Federal Reserve's holdings of agency debt and agency mortgage-backed securities received during each calendar month in agency mortgage-backed securities. Small deviations from these amounts for operational reasons are acceptable.", "The Committee also directs the Desk to engage in dollar roll and coupon swap transactions as necessary to facilitate settlement of the Federal Reserve's agency mortgage-backed securities transactions.\"", "More information regarding open market operations and reinvestments may be found on the Federal Reserve Bank of New York's website.", "For media inquiries, call 202-452-2955.", "Federal Reserve announces extensive new measures to support the economy"], "doc_type": "St"}, "entity_sentiments": {"Federal Reserve": {"score": 0.10000000149011612, "magnitude": 1.0, "salience": 0.048776235431432724}, "range": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.01866743341088295}, "employment": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.016414189711213112}, "price stability goals": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.016414189711213112}, "tools": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.016414189711213112}, "U.S.": {"score": 0.20000000298023224, "magnitude": 0.4000000059604645, "salience": 0.006607465911656618}, "repurchase agreement operations": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004500663373619318}, "Open Market Desk": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004146230407059193}, "addition": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.003371438244357705}, "measures": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0031168090645223856}, "term": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.002289197174832225}, "dollar funding markets": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.001129099982790649}, "reserves": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0010747415944933891}, "supply": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0007466318784281611}}, "paragraph_count": 12, "word_count": 588, "n_gram_count": {"1": 588, "2": 587, "3": 586}, "pos_tags_count": {"noun_count": 83, "verb_count": 37, "adjective_count": 57}, "change_in_vix": -12.204185409739868, "change_in_s_n_p_500": -2.3503027584660283}