{"fomc_doc": {"meeting_date": "2020-09-16", "paragraphs": ["The Federal Reserve is committed to using its full range of tools to support the U.S. economy in this challenging time, thereby promoting its maximum employment and price stability goals.", "The COVID-19 pandemic is causing tremendous human and economic hardship across the United States and around the world. Economic activity and employment have picked up in recent months but remain well below their levels at the beginning of the year. Weaker demand and significantly lower oil prices are holding down consumer price inflation. Overall financial conditions have improved in recent months, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.", "The path of the economy will depend significantly on the course of the virus. The ongoing public health crisis will continue to weigh on economic activity, employment, and inflation in the near term, and poses considerable risks to the economic outlook over the medium term.", "The Committee seeks to achieve maximum employment and inflation at the rate of 2 percent over the longer run. With inflation running persistently below this longer-run goal, the Committee will aim to achieve inflation moderately above 2 percent for some time so that inflation averages 2 percent over time and longer-term inflation expectations remain well anchored at 2 percent. The Committee expects to maintain an accommodative stance of monetary policy until these outcomes are achieved. The Committee decided to keep the target range for the federal funds rate at 0 to 1/4 percent and expects it will be appropriate to maintain this target range until labor market conditions have reached levels consistent with the Committee's assessments of maximum employment and inflation has risen to 2 percent and is on track to moderately exceed 2 percent for some time. In addition, over coming months the Federal Reserve will increase its holdings of Treasury securities and agency mortgage-backed securities at least at the current pace to sustain smooth market functioning and help foster accommodative financial conditions, thereby supporting the flow of credit to households and businesses.", "In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals. The Committee's assessments will take into account a wide range of information, including readings on public health, labor market conditions, inflation pressures and inflation expectations, and financial and international developments.", "Voting for the monetary policy action were Jerome H. Powell, Chair; John C. Williams, Vice Chair; Michelle W. Bowman; Lael Brainard; Richard H. Clarida; Patrick Harker; Loretta J. Mester; and Randal K. Quarles.", "Voting against the action were Robert S. Kaplan, who expects that it will be appropriate to maintain the current target range until the Committee is confident that the economy has weathered recent events and is on track to achieve its maximum employment and price stability goals as articulated in its new policy strategy statement, but prefers that the Committee retain greater policy rate flexibility beyond that point; and Neel Kashkari, who prefers that the Committee indicate that it expects to maintain the current target range until core inflation has reached 2 percent on a sustained basis.", "Implementation Note issued September 16, 2020"], "doc_type": "St"}, "entity_sentiments": {"price stability goals": {"score": 0.10000000149011612, "magnitude": 0.20000000298023224, "salience": 0.12582968175411224}, "employment": {"score": 0.10000000149011612, "magnitude": 0.30000001192092896, "salience": 0.1197308748960495}, "Federal Reserve": {"score": 0.20000000298023224, "magnitude": 1.0, "salience": 0.060961391776800156}, "range": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.0369359627366066}, "economy": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.03281402215361595}, "pandemic": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.026195034384727478}, "tools": {"score": 0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.024554459378123283}, "U.S.": {"score": 0.10000000149011612, "magnitude": 0.6000000238418579, "salience": 0.021654652431607246}, "hardship": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.011833705939352512}, "inflation": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.008611013181507587}, "COVID-19": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.007004445418715477}, "crisis": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.006465671584010124}, "conditions": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005944522563368082}, "credit": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.005049268715083599}, "health": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.0050284285098314285}, "policy measures": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004435508977621794}, "part": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.004435508977621794}, "stance": {"score": 0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.003749136347323656}, "term": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0037195896729826927}, "risks": {"score": -0.10000000149011612, "magnitude": 0.10000000149011612, "salience": 0.0033926600590348244}, "outlook": {"score": -0.20000000298023224, "magnitude": 0.20000000298023224, "salience": 0.0033926600590348244}}, "paragraph_count": 8, "word_count": 553, "n_gram_count": {"1": 553, "2": 552, "3": 551}, "pos_tags_count": {"noun_count": 112, "verb_count": 26, "adjective_count": 51}, "change_in_vix": 0.36057692307692246, "change_in_s_n_p_500": -0.7939318812348732}